Autodesk.Revit.DB.ATFXMLImportOptions.SetMaterialClassName(System.String)
Sets the material class name to be applied to materials created during import.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2023

Autodesk.Revit.DB.ATFXMLImportOptions.GeometryConversionOptions
Specifies the conversion options for import of ATF mesh and ATF solid geometry.
These values can be specified independently and allows Mesh Only, Solid Only,
Mesh then Solid, Solid then Mesh, None.
By default Solids are preferred and Meshes are used as a backup.
Since:
2022